PenguinSouvenirs = {
    '1629596387': {"location": " 木卫二：卡德马斯山脊", "name": "🐧#1"},
    '271815222': {"location": "木卫二：无尽之井", "name": "🐧#2"},
    '3880966469': {"location": "木卫二：薄暮废墟", "name": "🐧#3"},
    '3420140384': {"location": "木卫二：布瑞Exo科学所", "name": "🐧#4"},
    '3890313479': {"location": "木卫二：猎犬座深渊", "name": "🐧#5"},
    '290570570': {"location": "木卫二：猎犬座深渊", "name": "🐧#6"},
    '3254863625': {"location": "木卫二：重生的里斯入口", "name": "🐧#7"},
    '1313979588': {"location": "木卫二：枢纽", "name": "🐧#8"},
    '1610085355': {"location": "木卫二：凯尔高地", "name": "🐧#9"}
}


egg = {
    '1101252171': {"location": "幽梦之城：破碎王座", "name": "🥚#1"},
    '1101252168': {"location": "幽梦之城：破碎王座", "name": "🥚#2"},
    '1101252169': {"location": "幽梦之城：破碎王座", "name": "🥚#3"},
    '1101252174': {"location": "幽梦之城：破碎王座", "name": "🥚#4"},
    '1101252175': {"location": "幽梦之城：破碎王座", "name": "🥚#5"},
    '1101252172': {"location": "幽梦之城：破碎王座", "name": "🥚#6"},
    '1101252173': {"location": "幽梦之城：破碎王座", "name": "🥚#7"},
    '1101252162': {"location": "幽梦之城：破碎王座", "name": "🥚#8"},
    '1101252163': {"location": "幽梦之城：破碎王座", "name": "🥚#9"},
    '1118029885': {"location": "最后一愿：睽目之塔", "name": "🥚#10"},
    '1118029884': {"location": "最后一愿：始源尖塔", "name": "🥚#11"},
    '1118029887': {"location": "最后一愿：语声要塞", "name": "🥚#12"},
    '1118029886': {"location": "最后一愿：双魂大厅", "name": "🥚#13"},
    '1118029881': {"location": "最后一愿：双魂大厅", "name": "🥚#14"},
    '1118029880': {"location": "腐化：伊琳圣庙", "name": "🥚#15"},
    '1118029883': {"location": "腐化：伊琳圣庙", "name": "🥚#16"},
    '1118029882': {"location": "幽梦之城：预言者隐所", "name": "🥚#17"},
    '1118029877': {"location": "幽梦之城：预言者隐所", "name": "🥚#18"},
    '1118029876': {"location": "幽梦之城：预言者隐所", "name": "🥚#19"},
    '1067696996': {"location": "幽梦之城：艾希拉花园", "name": "🥚#20"},
    '1067696997': {"location": "幽梦之城：艾希拉花园", "name": "🥚#21"},
    '1067696998': {"location": "幽梦之城：迪瓦里安迷雾", "name": "🥚#22"},
    '1067696999': {"location": "幽梦之城：克蕾丝脊柱", "name": "🥚#23"},
    '1067696992': {"location": "幽梦之城：克蕾丝脊柱", "name": "🥚#24"},
    '1067696993': {"location": "幽梦之城：克蕾丝脊柱", "name": "🥚#25"},
    '1067696994': {"location": "上维挑战：星光大殿", "name": "🥚#26"},
    '1067696995': {"location": "上维挑战：星光大殿", "name": "🥚#27"},
    '1067697004': {"location": "上维挑战：星光大殿", "name": "🥚#28"},
    '1067697005': {"location": "上维挑战：克蕾丝脊柱", "name": "🥚#29"},
    '1084474583': {"location": "上维挑战：克蕾丝脊柱", "name": "🥚#30"},
    '1084474582': {"location": "上维挑战：溺亡之愿海湾", "name": "🥚#31"},
    '1084474581': {"location": "上维挑战：溺亡之愿海湾", "name": "🥚#32"},
    '1084474580': {"location": "上维挑战：溺亡之愿海湾", "name": "🥚#33"},
    '1084474579': {"location": "上维挑战：预言者隐所", "name": "🥚#34"},
    '1084474578': {"location": "上维挑战：预言者隐所", "name": "🥚#35"},
    '1084474577': {"location": "上维挑战：远日点之栖", "name": "🥚#36"},
    '1084474576': {"location": "上维挑战：远日点之栖", "name": "🥚#37"},
    '1084474591': {"location": "上维挑战：远日点之栖", "name": "🥚#38"},
    '1084474590': {"location": "上维挑战：艾希拉花园", "name": "🥚#39"},
    '1034141726': {"location": "上维挑战：艾希拉花园", "name": "🥚#40"}}


record = 4175199845


bones = {
    '1387596459': {"name": "🦴#1", "location": '破碎王座：第一关', 'lore': '信仰屠戮I'},
    '1370818864': {"name": "🦴#2", "location": '破碎王座：第二关', 'lore': '宇宙回旋II'},
    '1370818871': {"name": "🦴#3", "location": '破碎王座：第二关', 'lore': '前言'},
    '1370818868': {"name": "🦴#4", "location": '破碎王座：第三关', 'lore': '新生I'},
    '1387596461': {"name": "🦴#5", "location": '幽梦之城：克蕾丝脊柱', 'lore': '信仰屠戮III'},
    '1370818865': {"name": "🦴#6", "location": '幽梦之城：克蕾丝脊柱', 'lore': '宇宙回旋III'},
    '1387596458': {"name": "🦴#7", "location": '幽梦之城：女王大厅', 'lore': '信仰屠戮II'},
    '1370818869': {"name": "🦴#8", "location": '腐化', 'lore': '新生II'},
    '1370818867': {"name": "🦴#9", "location": '腐化', 'lore': '宇宙回旋I'},
    '1387596456': {"name": "🦴#10", "location": '剧情：黑暗修道院', 'lore': '沉迷III'},
    '1370818878': {"name": "🦴#11", "location": '上维挑战：溺亡之愿海湾', 'lore': '宇宙回旋IV'},
    '1370818866': {"name": "🦴#12", "location": '上维挑战：星光大殿', 'lore': '新生III'},
    '1387596463': {"name": "🦴#13", "location": '上维挑战：远日点之栖', 'lore': '强加者I'},
    '1387596460': {"name": "🦴#14", "location": '上维挑战：艾希拉花园', 'lore': '异教论'},
    '1370818879': {"name": "🦴#15", "location": '上维挑战：克蕾丝脊柱', 'lore': '沉迷I'},
    '1387596457': {"name": "🦴#16", "location": '上维挑战：预言者隐所', 'lore': '沉迷II'}
}


增幅 = {
    '2181119074': {'name': '✈#1', 'location': '增幅：布瑞Exo科学所'},
    '2181119075': {'name': '✈#2', 'location': '增幅：永恒'},
    '2181119072': {'name': '✈#3', 'location': '增幅：创世所'},
    '2181119073': {'name': '✈#4', 'location': '增幅：重生的里斯入口'},
    '2181119078': {'name': '✈#5', 'location': '增幅：技术专家的烙印'},
    '2181119079': {'name': '✈#6', 'location': '增幅：凯尔高地'},
    '2181119076': {'name': '✈#7', 'location': '增幅：枢纽'},
    '2181119077': {'name': '✈#8', 'location': '增幅：无尽之井'}}


nightmare = {
    '202553883': {'name': '', 'time': ''},
    '1014773306': {'name': '', 'time': ''},
    '2771763709': {'name': '', 'time': ''},
    '3006411263': {'name': '', 'time': ''},
    '2304272073': {'name': '', 'time': ''},
    '1554766171': {'name': '', 'time': ''},
    '2358910877': {'name': '', 'time': ''},
    '7358862': {'name': '', 'time': ''}
}

cats = {
    '2576690974': {'name': '🐱#1', 'location': '幽梦之城：滨岸'},
    '2420371297': {'name': '🐱#2', 'location': '幽梦之城：艾希拉花园'},
    '2253687296': {'name': '🐱#3', 'location': '幽梦之城：克蕾丝脊柱'},
    '1159650715': {'name': '🐱#4', 'location': '幽梦之城：克蕾丝脊柱'},
    '2853314242': {'name': '🐱#5', 'location': '幽梦之城：雷亚希尔维亚'},
    '56362725': {'name': '🐱#6', 'location': '幽梦之城：预言者隐所'},
    '4262976548': {'name': '🐱#7', 'location': '幽梦之城：预言者隐所'},
    '3629051903': {'name': '🐱#8', 'location': '幽梦之城：迪瓦里安迷雾'},
    '3255812950': {'name': '🐱#9', 'location': '幽梦之城：雷亚希尔维亚'}
}

称号 = {
    '3298130972': {'name': '天下无双', 'gold': 10},
    '3464275895': {'name': '征服者', 'gold': 10},
    '1343839969': {'name': '不羁者', 'gold': 15},
    '1556658903': {'name': '德瑞捷', 'gold': 16},
    '2482004751': {'name': '破碎凌霄'},
    '1087927672': {'name': '天选者'},
    '540377256': {'name': '光影后裔'},
    '1561715947': {'name': '守望者'},
    '2584970263': {'name': '先知'},
    '2909250963': {'name': '证悟者'},
    '3214425110': {'name': '破咒者'},
    '1384029371': {'name': '魅痕克星'}
}


传承称号 = {
    '2126548397': '天下无双-S12',
    '2980266417': '天下无双-S11',
    '2072890963': '天下无双-S10',

    '4167244320': '征服者-S12',
    '2056461735': '暗影',
}


死去的机灵 = {

    '165164586': {'name': '📕#1', 'location': ''},
    '795077111': {'name': '📕#2', 'location': ''},
    '1176209846': {'name': '📕#3', 'location': ''},
    '1926293609': {'name': '📕#4', 'location': ''},
    '2780856872': {'name': '📕#5', 'location': ''},
    '3060958463': {'name': '📕#6', 'location': ''},
    '3487734533': {'name': '📕#7', 'location': ''},
    '3553369003': {'name': '📕#8', 'location': ''},
    '3894429461': {'name': '📕#9', 'location': ''},
    '4085847388': {'name': '📕#10', 'location': ''},


}

Exo = {

    "3854379920": {'name': '🐾#1', 'location': '木卫二：隐匿虚空'},
    "1287812596": {'name': '🐾#2', 'location': '木卫二：猎犬座深渊'},
    "1291596818": {'name': '🐾#3', 'location': '木卫二：无尽之井'},
    "2578791723": {'name': '🐾#4', 'location': '木卫二：卡德马斯山脊'},
    "2039102766": {'name': '🐾#5', 'location': '木卫二：永劫地狱'},
    "2717332017": {'name': '🐾#6', 'location': '木卫二：布瑞Exo科学所'},
    "3239366412": {'name': '🐾#7', 'location': '木卫二：创世所'},
    "4176343351": {'name': '🐾#8', 'location': '木卫二：地堡E15'},
    "3497190125": {'name': '🐾#9', 'location': '木卫二：薄暮废墟'}
}


暗熵碎片 = {
    '2677830030': {'name': '🔷#1', 'location': '木卫二：猎犬座深渊'},
    '523132396': {'name': '🔷#2', 'location': '木卫二：隐匿虚空'},
    '2927552589': {'name': '🔷#3', 'location': '木卫二：卡德马斯山脊'},
    '3482887819': {'name': '🔷#4', 'location': '木卫二：薄暮废墟'},
    '2679813844': {'name': '🔷#5', 'location': '木卫二：地堡E15'},
    '3527611025': {'name': '🔷#6', 'location': '木卫二：重生的里斯入口'},
    '951414128': {'name': '🔷#7', 'location': '木卫二：凯尔高地'},
    '1217064983': {'name': '🔷#8', 'location': '木卫二：技术专家的烙印'},
    '1146417010': {'name': '🔷#9', 'location': '木卫二：创世所'}
}

证章 = {
    '4257248973': '黎明赛季',
    '2078340986': '木卫二收藏家',
    '2388540594': '月球漫游者',
    '3642989833': '目的地：幽梦之城',
    '564984975': '奥斯里斯试炼',
    '1420354007': '收藏玩家',
    '701100740': '烈火锻造',
    '223465203': '神圣使命',
    '1235050036': '突袭：深岩墓室',
    '1086048586': '突袭：最后一愿',
    '2399267278': '年票：《黑色军武》',
    '2503214417': '年票：《莫测鬼牌》',
    '2759158924': '年票：丰盈赛季',
}
# ：老兵门徒
# '3267852685': '不朽赛季',
# '2881240068': '目的地：《遗落之族》',
# '1331476689': '目的地：《冥王诅咒》和《战争思维》',
# '2904806741': '目的地：猩红战争',
# '3241617029': '异域：猩红战争',
# '1419883649': '异域：《冥王诅咒》和《战争思维》',
# '3333531796': '异域：《遗落之族》',


赛季挑战 = {
    '1371596488': '第1周',
    '1371596491': '第2周',
    '1371596490': '第3周',
    '1371596493': '第4周',
    '1371596492': '第5周',
    '1371596495': '第6周',
    '1371596494': '第7周',
    '1371596481': '第8周',
    '1371596480': '第9周',
    '2058046696': '第10周',
    '193232030': '天选赛季'
}


前兆 = {
    '碎片': {
        '1437052814': '第一周：答案的虚构',  # 3838695215
        '1437052815': '第二周：序列中的一环',  # 10959788
        '1437052812': '第三周：所有散落的碎片'
    },
    '成就': {
        '952432579': '书页：记忆的束缚'
    }
}

DSC = {
    '挑战': {
        '2843965578': {'name': '红色流浪者', 'recordHash': '22094034'},
        '2550390038': {'name': '复制的复制', 'recordHash': '64856166'},
        '858683099': {'name': '各行各业', 'recordHash': '337542929'},
        '2571073458': {'name': '四号核心', 'recordHash': '2530940166'}
    },
    'Phase': {
        'a': 'b'
    }




}
