PenguinSouvenirs = {
    '1629596387': {"location": " 木卫二：卡德马斯山脊", "name": "🐧#1"},
    '271815222': {"location": "木卫二：无尽之井", "name": "🐧#2"},
    '3880966469': {"location": "木卫二：薄暮废墟", "name": "🐧#3"},
    '3420140384': {"location": "木卫二：布瑞Exo科学所", "name": "🐧#4"},
    '3890313479': {"location": "木卫二：猎犬座深渊", "name": "🐧#5"},
    '290570570': {"location": "木卫二：猎犬座深渊", "name": "🐧#6"},
    '3254863625': {"location": "木卫二：重生的里斯入口", "name": "🐧#7"},
    '1313979588': {"location": "木卫二：枢纽", "name": "🐧#8"},
    '1610085355': {"location": "木卫二：凯尔高地", "name": "🐧#9"}
}


egg = {
    '1101252171': {"location": "幽梦之城：破碎王座", "name": "🥚#1"},
    '1101252168': {"location": "幽梦之城：破碎王座", "name": "🥚#2"},
    '1101252169': {"location": "幽梦之城：破碎王座", "name": "🥚#3"},
    '1101252174': {"location": "幽梦之城：破碎王座", "name": "🥚#4"},
    '1101252175': {"location": "幽梦之城：破碎王座", "name": "🥚#5"},
    '1101252172': {"location": "幽梦之城：破碎王座", "name": "🥚#6"},
    '1101252173': {"location": "幽梦之城：破碎王座", "name": "🥚#7"},
    '1101252162': {"location": "幽梦之城：破碎王座", "name": "🥚#8"},
    '1101252163': {"location": "幽梦之城：破碎王座", "name": "🥚#9"},
    '1118029885': {"location": "最后一愿：睽目之塔", "name": "🥚#10"},
    '1118029884': {"location": "最后一愿：始源尖塔", "name": "🥚#11"},
    '1118029887': {"location": "最后一愿：语声要塞", "name": "🥚#12"},
    '1118029886': {"location": "最后一愿：双魂大厅", "name": "🥚#13"},
    '1118029881': {"location": "最后一愿：双魂大厅", "name": "🥚#14"},
    '1118029880': {"location": "腐化：伊琳圣庙", "name": "🥚#15"},
    '1118029883': {"location": "腐化：伊琳圣庙", "name": "🥚#16"},
    '1118029882': {"location": "幽梦之城：预言者隐所", "name": "🥚#17"},
    '1118029877': {"location": "幽梦之城：预言者隐所", "name": "🥚#18"},
    '1118029876': {"location": "幽梦之城：预言者隐所", "name": "🥚#19"},
    '1067696996': {"location": "幽梦之城：艾希拉花园", "name": "🥚#20"},
    '1067696997': {"location": "幽梦之城：艾希拉花园", "name": "🥚#21"},
    '1067696998': {"location": "幽梦之城：迪瓦里安迷雾", "name": "🥚#22"},
    '1067696999': {"location": "幽梦之城：克蕾丝脊柱", "name": "🥚#23"},
    '1067696992': {"location": "幽梦之城：克蕾丝脊柱", "name": "🥚#24"},
    '1067696993': {"location": "幽梦之城：克蕾丝脊柱", "name": "🥚#25"},
    '1067696994': {"location": "上维挑战：星光大殿", "name": "🥚#26"},
    '1067696995': {"location": "上维挑战：星光大殿", "name": "🥚#27"},
    '1067697004': {"location": "上维挑战：星光大殿", "name": "🥚#28"},
    '1067697005': {"location": "上维挑战：克蕾丝脊柱", "name": "🥚#29"},
    '1084474583': {"location": "上维挑战：克蕾丝脊柱", "name": "🥚#30"},
    '1084474582': {"location": "上维挑战：溺亡之愿海湾", "name": "🥚#31"},
    '1084474581': {"location": "上维挑战：溺亡之愿海湾", "name": "🥚#32"},
    '1084474580': {"location": "上维挑战：溺亡之愿海湾", "name": "🥚#33"},
    '1084474579': {"location": "上维挑战：预言者隐所", "name": "🥚#34"},
    '1084474578': {"location": "上维挑战：预言者隐所", "name": "🥚#35"},
    '1084474577': {"location": "上维挑战：远日点之栖", "name": "🥚#36"},
    '1084474576': {"location": "上维挑战：远日点之栖", "name": "🥚#37"},
    '1084474591': {"location": "上维挑战：远日点之栖", "name": "🥚#38"},
    '1084474590': {"location": "上维挑战：艾希拉花园", "name": "🥚#39"},
    '1034141726': {"location": "上维挑战：艾希拉花园", "name": "🥚#40"}}


record = 4175199845


bones = {
    '4114145492': {"name": "🦴#1", "location": '破碎王座：第一关', 'lore': '信仰屠戮I'},
    '4130923087': {"name": "🦴#2", "location": '破碎王座：第二关', 'lore': '宇宙回旋II'},
    '4130923080': {"name": "🦴#3", "location": '破碎王座：第二关', 'lore': '前言'},
    '4130923083': {"name": "🦴#4", "location": '破碎王座：第三关', 'lore': '新生I'},
    '4114145490': {"name": "🦴#5", "location": '幽梦之城：克蕾丝脊柱', 'lore': '信仰屠戮III'},
    '4130923086': {"name": "🦴#6", "location": '幽梦之城：克蕾丝脊柱', 'lore': '宇宙回旋III'},
    '4114145493': {"name": "🦴#7", "location": '幽梦之城：女王大厅', 'lore': '信仰屠戮II'},
    '4130923082': {"name": "🦴#8", "location": '腐化', 'lore': '新生II'},
    '4130923084': {"name": "🦴#9", "location": '腐化', 'lore': '宇宙回旋I'},
    '4114145495': {"name": "🦴#10", "location": '剧情：黑暗修道院', 'lore': '沉迷III'},
    '4130923073': {"name": "🦴#11", "location": '上维挑战：溺亡之愿海湾', 'lore': '宇宙回旋IV'},
    '4130923085': {"name": "🦴#12", "location": '上维挑战：星光大殿', 'lore': '新生III'},
    '4114145488': {"name": "🦴#13", "location": '上维挑战：远日点之栖', 'lore': '强加者I'},
    '4114145491': {"name": "🦴#14", "location": '上维挑战：艾希拉花园', 'lore': '异教论'},
    '4130923072': {"name": "🦴#15", "location": '上维挑战：克蕾丝脊柱', 'lore': '沉迷I'},
    '4114145494': {"name": "🦴#16", "location": '上维挑战：预言者隐所', 'lore': '沉迷II'}
}


增幅 = {
    '2181119074': {'name': '✈#1', 'location': '增幅：布瑞Exo科学所'},
    '2181119075': {'name': '✈#2', 'location': '增幅：永恒'},
    '2181119072': {'name': '✈#3', 'location': '增幅：创世所'},
    '2181119073': {'name': '✈#4', 'location': '增幅：重生的里斯入口'},
    '2181119078': {'name': '✈#5', 'location': '增幅：技术专家的烙印'},
    '2181119079': {'name': '✈#6', 'location': '增幅：凯尔高地'},
    '2181119076': {'name': '✈#7', 'location': '增幅：枢纽'},
    '2181119077': {'name': '✈#8', 'location': '增幅：无尽之井'}}


nightmare = {
    '202553883': {'name': '', 'time': ''},
    '1014773306': {'name': '', 'time': ''},
    '2771763709': {'name': '', 'time': ''},
    '3006411263': {'name': '', 'time': ''},
    '2304272073': {'name': '', 'time': ''},
    '1554766171': {'name': '', 'time': ''},
    '2358910877': {'name': '', 'time': ''},
    '7358862': {'name': '', 'time': ''}
}
